[{"title":"西点军校22条军规","date":"2017-04-10T13:53:24.000Z","path":"2017/04/10/西点军校22条军规/","text":"无条件执行。很少有人可以完全听得进去别人的劝告，可以耐心地接受下达的命令，因为似乎在人们的潜意识里，”叛逆”是一种个性和值得推崇的东西，殊不知”叛逆”同样需要服从的资本。西点军校学子、美国总统艾森豪威尔说过：”任何语言都是苍白的，你唯一需要的就是执行力，一个行动胜过一打计划”。的确，只有在行动中，才会让人感觉到生命的价值，才可以使人变得智慧、勇敢、坚毅和高尚起来。光说不做，什么都无法改变；抱怨着去做，只会更加难过；只做不说才是提升自我的首选。因为，服从本身也是对自我的尊重和肯定。 没有任何借口。任何带一丝借口的理由都是庸者，愚者自我安慰的掌上名言。”没有任何借口”所表达的内涵远比字面意思要深刻的多。它不仅仅是西点军校对所有学员提出的一个口号，更是我们整个人生需要奉行的一个重要的思想理念和行为准则。它体现的是一种完美的执行能力，一种服从，诚实的态度，一种负责，敬业的精神。而在现实生活中，我们所缺少的正是这种精神。借口成了一面挡箭牌，这本身就是一种不负责任的态度。长此以往有害而无益，因为有各种各样的借口可找，就会疏于努力，不再想方设法去争取成功。你若不想做，会找一个借口；你若想做，会找一个办法。 细节决定成败。人常说，无论做什么事情只要把握大方向就行了，至于那些细枝末节就不要去管了。殊不知”千里之堤，溃于蚁穴”，小事不注意往往会酿成大问题。西点军校前校长潘莫曾指出：”最聪明的人设计出来最伟大的计划，执行的时候还是必须从小处着手，整个计划的成败就取决于这些细节。”精辟地指出了想成就一番事业必须从简单的事情做起，从细微之处入手。如果说不拘小节拥有的是豁达的人生，那注重细节的人往往会成就非凡的事业。 以上司为榜样。这个世界只在乎你是否达到了一定的高度，而不在乎你是踩在巨人的肩膀上上去的还是踩在垃圾堆上上去的。上去的速度一定程度取决于学习的对象。正所谓人外人山外山，正因为有比自己强的人的存在，才有进步的动力。所以遇到强者是件幸运的事，意味着未来无限精彩的人生。对于值得自己学习的人和事，竭尽全力，这才是正确的人生态度。某种意义上它的背后隐藏的就是成功。 荣誉原则。所谓荣誉，就是一种向人们展示自己，并可以让人终身受益的资本。是否有荣誉心关系到事情的成败，而荣誉心是由自己的心去决定的。世上不知有多少安于现状的人，只因没有强烈的荣誉观念，所以他们得过且过，每天重复枯燥的生活，永无为目标去努力去激情的感受。其实很多时候，他们自身明明是可以做到的，却被自己丢弃在”平庸的荒漠”。 受人欢迎。人行于世，总希望和别人和和气气，快快乐乐的相处，某种程度上，这也是做好人办好事的前提。俗话说的好：得人心者得天下。一个能让人打心眼儿里喜欢的人，可以在社会上左右逢源。人有百种，各有所好。若能做到让人人都喜欢，就不是一般的能力了。世间有这种能力的人可以更快的完成自己的追求，并获得他人的认可，一举双得。 善于合作。21世纪是充满竞争的世纪，敢于冒险，善于合作，是21世纪对人才规格的基本要求。自己是独立的，但世界是大家的。人生在世，与人沟通和合作是必然的。善于合作，是指在需要互相配合的事情上能够与别人协调一致，做好自己的那个部分。在合作中，要学会乐于助人、虚心请教别人、团结友善、平等待人。养成良好的合作习惯，关系到生活好坏，事业成败。毕竟，个人力量是有限的，只有实现了资源的优化组合，与志同道合者合作，才能实现仅凭自己无法达成的愿望。 团队精神。一群优秀的人，这样组成的团队是拥有最强生命力和竞争力的团队。而在它背后支撑他们每个成员的巨大力量，便是可贵的团队精神，一种深入灵魂，指引心灵，激人奋进的精神。如果非得说有什么力量是无坚不摧的，那么就是有具备这种精神的最强的团队了，而个体也只有在这样的团队中，才可能发展的更好。 只有第一。成功是很多人的最终追求，而竞争意识是成功人士的特征之一。只争第一，只当第一，体现常胜者处于不败之地的信心和魄力。对于天生的挑战者来说，第二意味着做的不够，只有第一，才是永恒不变的追求。一个第一，两个第一……永不满足，永不停下脚步。只有这样的胆大和”妄为”，才能有更为持久的竞争力和主动地位。 敢于冒险。每一年，每一天，时时刻刻，我们每个人都处在一定的风险里，有风险的存在才有预防风险的方法。那些过于保守，缺乏创新意识的人很难成功，而且很多时候，与风险结伴而来的还有机遇。风险越大，机遇越难得。选择还是放弃就成为了人生岔路口的指向标，或功成名就或一败涂地，就看是否有敏锐的眼光和敢于尝试的勇气。 火一般的精神。有人说激情是年轻人的专利；也有人说激情是需要培养和刺激的。激情到底是什么？它对我们的人生又有着怎样与众不同的意义。这些虽非只言片语可以回答，但有一点可以肯定；激情，是每个人身上都应具有的精神，是生命对我们的馈赠。让我们也经历一次激情燃烧的岁月吧。 不断提升自己。成长，在于每一天的获得和积累；提高，在于自己的学习和努力。西点军校第一任校长，乔纳森·威廉斯曾说过：”不管你有多么伟大，你依然需要提升自己，如果你停止在现有的水平上，实际上你是在倒退。”小到言谈举止，大到人生态度，都离不开主动的提升。成功的路不止一条，成功的标准也不止一个。有勇气不断超越自己，不断超越过去的人，才有可能跻身于成功者的行列。 勇敢者的游戏。记得一首名为《勇敢者的心》的诗中这样写道：”用勇气之火去点燃希望之繁星，照亮人生过往中的每一日光阴，只因时间可以摧毁一切懦弱，却埋葬不了一颗勇敢者年轻的心。”一段人生，一场游戏，一个梦。既是游戏，总有输赢，不必为此揪心。只不过，这是一场只有勇敢者才玩得起的游戏。因为只有为梦想而坚持的人，才有胜出的可能，从而成就一段非凡的人生。 全力以赴。留有余地还是全力以赴？这是两种不同的处世态度，猛然看去似乎都有道理，事实上要分场合分事情。对于梦想，只需懂得这两句词就够了”把握生命中的每一分钟，全力以赴我们心中的梦，不经历风雨，怎么见彩虹，没有人能随随便便成功……” 尽职尽责。尽职尽责，这不仅是工作原则，也是人生的原则。做事一丝不苟能够迅速培养严谨的品格、获得超凡的智能；它既能带领普通人往好的方向前进，更能鼓舞优秀的人追求更高的境界。无论做何事，务必竭尽全力，因为它决定一个人日后事业上的成败。一个人一旦领悟了全力以赴地工作能消除工作辛劳这一秘诀，他就掌握了打开成功之门的钥匙了。能处处以主动尽职的态度工作，即使从事最平庸的职业也能增添个人的荣耀。 没有不可能。将”可能”变成”不可能”的人是十足的懒汉；而将”不可能”变成”可能”的人是自己人生的魔术师。这样的人常常会绝处逢生，再多的艰难困苦，在它面前似乎都只是”摆设”，能以很轻松的心态绕过前行。可能吗？不可能吗？一切都在于你自己是否想去争取，是否想去拥有。 永不放弃。在世界上，没有什么东西可以代替坚韧不拔的意志，在拥有这种意志力的人的身上没有所谓的”滑铁卢”，更看不到沮丧的眼泪，不论面对怎样的困境，多大的打击，他们总是埋头苦干，从不轻言放弃。因为他们明白，期待的胜利往往就产生了再坚持一下的努力之中。这是一种可贵的品质，也是成大事立大业者的特征。 敬业为魂。工作随着志向走，志向随着工作来。既然工作是志向所指，那必然是要竭尽所能去做的。做一个踏实的工作者，是表现自己的正途，用自身的积极行动去证明你是一个不可或缺的人。要知道，任何一个双手插在口袋里的人都爬不上成功的梯子。只有对事业全身心投入的人，才会获得事业的成功。 为自己奋斗。每个人的人生就像一个金字塔，越往上走，你所享受的空间就越大。但大多数人宁可平庸，按部就班的过日子，辛苦地维持现状。只有少数人能在塔里漫步，游刃有余的生活，欣赏塔顶的风光，享受成功的喜悦，这类人就是知道自己为谁而奋斗的人。而当一个人先从自己内心开始奋斗时，他就是个有价值的人。每当想到你所要追求的，动力就会在你的身边。崇高的目标会为你带来无尽的快乐和激情。为自己奋斗，一切都不成问题。 理念至上。有什么样的想法就有什么样的选择。有什么样的选择就有什么样的生活。我们虽然不能成为贵族的后代，但是通过我们的努力，我们可以成为贵族的祖先。这是一个充满竞争的时代，要想走向成功卓越，必须学会从起点之前赢得先机。在瞬息万变的各色竞争中，作为智慧之光的想法理念，是制胜的尚方宝剑。理念就是财富，就是资本，所以，拥有了它就拥有了成功的契机。 自动自发。所谓的主动，指的是随时准备把握机会，展现超乎他人要求的工作和表现，以及拥有”为了完成任务，必要时不惜打破成规”的智慧和判断力。我们的人生好比一份考卷，单选，多选，不定项，无其不有。什么是必须做的，什么是可以做的，什么是可做可不做的，都应心知肚明。主动一些，多比别人做一道，就会多学一点，多一份成功的可能。 立即行动。一个人一生的时间是有限的。今天你在二十四小时里无所事事，就意味着在明天的二十四小时里焦头烂额。时间对于每个人都是公平的，浪费自己的时间无异于慢性自杀。而人生里最大的成功就是在最短的时间里达成最多的目标，实现最大的价值。所以，要过有意义的人生，就不要耽搁，立即行动吧！","tags":[{"name":"encouragement","slug":"encouragement","permalink":"http://yoursite.com/tags/encouragement/"}]},{"title":"Hexo页面部署小技巧","date":"2017-04-10T13:48:11.000Z","path":"2017/04/10/Hexo页面部署小技巧/","text":"手把手教你用Hexo+Github 搭建属于自己的博客: http://blog.csdn.net/gdutxiaoxu/article/details/53576018Hexo官方文档：https://hexo.io/zh-cn/docs/相册效果步骤：http://www.cnblogs.com/jarson-7426/p/5515870.html有道云笔记Markdown指南：http://note.youdao.com/iyoudao/?p=2411&amp;vendor=unsilent14手把手教你用Hexo+Github 搭建属于自己的博客: http://blog.csdn.net/gdutxiaoxu/article/details/53576018将本地代码上传至github备份的操作方法: http://www.cnblogs.com/ljy2013/p/5547993.html","tags":[{"name":"skill","slug":"skill","permalink":"http://yoursite.com/tags/skill/"}]},{"title":"first","date":"2017-04-10T09:34:41.000Z","path":"2017/04/10/first/","text":"Hello world, my first page. 你好，世界。","tags":[{"name":"test","slug":"test","permalink":"http://yoursite.com/tags/test/"}]}]